//
//  Error.strings
//  Nextcloud iOS
//
//  Copyright (c) 2017 TWS. All rights reserved.
//
//  Author Marino Faggiana <m.faggiana@twsweb.it>
//
//  This program is free software: you can redistribute it and/or modify
//  it under the terms of the GNU General Public License as published by
//  the Free Software Foundation, either version 3 of the License, or
//  (at your option) any later version.
//
//  This program is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU General Public License for more details.
//
//  You should have received a copy of the GNU General Public License
//  along with this program.  If not, see <http://www.gnu.org/licenses/>.
//


"_bad_username_password_"               = "Nesprávné přihlašovací jméno nebo heslo";
"_cancelled_by_user"                    = "Přenos zrušen";
"_error_folder_destiny_is_the_same_"    = "Není možné přesunout složku do sama sebe";
"_error_not_permission_"                = "K dokončení operace nemáte oprávnění";
"_error_path_"                          = "Tento soubor nebo složku se nedaří otevřít. Ověřte, že existuje";
"_file_upload_not_exitst_"              = "Soubor, který chcete nahrát, neexistuje";
"_forbidden_characters_from_server_"    = "Jméno obsahuje přinejmenším jeden neplatný znak";
"_not_connected_internet_"              = "Chyba připojení k serveru";
"_not_possible_connect_to_server_"      = "Nyní se nelze k serveru připojit";
"_not_possible_create_folder_"          = "Složku se nepodařilo vytvořit";
"_server_down_"                         = "Nedaří se navázat kontakt se serverem";
"_time_out_"                            = "Časový limit, zkuste to znovu";
"_unknow_response_server_"              = "Neočekávaná odpověď serveru";
"_user_autentication_required_"         = "Požadována autentizace uživatele";
"_file_directory_locked_"               = "Soubor či adresář uzamčen";
"_ssl_certificate_untrusted_"           = "Certifikát tohoto serveru není platný";
"_internal_server_"                     = "Vnitřní chyba serveru";
"_file_already_exists_"                 = "Operaci není možné dokončit, soubor s takovým názvem už existuje";
"_file_folder_not_exists_"              = "Zdrojový soubor nebyl v zadaném umístění nalezen";
"_folder_contents_nochanged_"           = "Obsah složky se nezměnil";
"_images_invalid_converted_"            = "Obrázek není platný a nelze ho převést na náhled";
"_method_not_expected_"                 = "Neočekávaná metoda požadavku";
"_reauthenticate_user_"                 = "Platnost přístupu skončila, znovu se přihlaste";
"_server_error_retry_"                  = "Server je dočasně nedostupný";
"_too_many_files_"                      = "Operace by se dotkla příliš mnoha souborů";
"_too_many_request_"                    = "Odeslání příliš mnoha požadavků způsobilo dosažení rychlostního limitu";
"_user_over_quota_"                     = "Povolená kvóta úložiště dosažena";
"_ssl_connection_error_"                = "Chyba SSL spojení, zkuste to znovu";
"_bad_request_"                         = "Neplatný požadavek ";
"_webdav_locked_"                       = "WebDAV uzamčen, pokus o přístup k uzamčenému zdroji";
"_error_user_not_available_"            = "Uživatel už není k dispozici";
"_server_response_error_"               = "Chyba obsahu odpovědi serveru";


